In [1]:
import numpy as np
import pandas as pd

In [2]:
# Sample quiz from Tuesday -- simple homework
# only graded out of 100 points to show what your quiz will look like
# Quiz #1 on thursday, everything through last Thursday class
# grade it, with comments

# Missing Values

In [3]:
# Why missing values?
# No data, value, bug in storing it, laziness, can't be measure

In [6]:
# Create DataFrame List (list of list)
df = pd.DataFrame([[1, np.nan, 2], [0,3,5],
                 [np.nan,4,6]])

In [7]:
# np.nan = null
# columns with Nans' have floats, cause nans are floats
# every number in numpy array have to be the same type
df

     0    1  2
0  1.0  NaN  2
1  0.0  3.0  5
2  NaN  4.0  6

In [8]:
# check and return which ones are null
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [10]:
# check and return which ones are null
df.isna()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [11]:
# check and return which ones are not null
df.notnull()

       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True

In [13]:
# check and return which ones are null
df.notna()

       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True

In [14]:
# returns which each columns have null
df.isna().any()

0     True
1     True
2    False
dtype: bool

In [15]:
# return any null values in a series
df.isna().any().any()

True

In [20]:
# check how many null values
# .sum().sum() // sum the columns and then sum the series
df.isna().sum().sum()

2

In [22]:
# check how many nulls values
df.isna().values.sum()

2

In [23]:
# return true or false if theres any null
df.isna().values.any()

True

In [24]:
customers = pd.read_csv('Mall_Customers_missing.csv')

In [25]:
customers.head()

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male  21.0                15.0                    81.0
2           3  Female  20.0                16.0                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                    40.0

In [26]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     196 non-null    float64
 3   Annual Income (k$)      196 non-null    float64
 4   Spending Score (1-100)  192 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.9+ KB

In [28]:
customers.dtypes

CustomerID                  int64
Gender                     object
Age                       float64
Annual Income (k$)        float64
Spending Score (1-100)    float64
dtype: object

In [29]:
customers.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [30]:
# check number of (rows, columns)
customers.shape

(200, 5)

In [32]:
customers.describe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  196.000000          196.000000              192.000000
mean   100.500000   39.025510           60.551020               50.005208
std     57.879185   13.972294           26.469963               25.761999
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   29.000000           41.500000               33.500000
50%    100.500000   36.000000           61.000000               50.000000
75%    150.250000   49.000000           78.000000               72.250000
max    200.000000   70.000000          137.000000               99.000000

In [33]:
# check if the df have missing values
customers.isna().any().any()

True

In [34]:
# check which columns have missing values
customers.isna().any()

CustomerID                False
Gender                    False
Age                        True
Annual Income (k$)         True
Spending Score (1-100)     True
dtype: bool

In [35]:
# check how many missing values in each columns
customers.isna().sum()

CustomerID                0
Gender                    0
Age                       4
Annual Income (k$)        4
Spending Score (1-100)    8
dtype: int64

In [37]:
# check the percentage of null values in each columns
customers.isna().sum() / len(customers)

CustomerID                0.00
Gender                    0.00
Age                       0.02
Annual Income (k$)        0.02
Spending Score (1-100)    0.04
dtype: float64

In [45]:
# Check how many rows have null values?
# check null values, return any rows with axis = 1 and sum up the ones have null values
customers.isna().any(axis = 1).sum()

14

In [39]:
# return sum of all nulls values in df
customers.isna().sum().sum()

16

In [50]:
# print out those rows have null values
# subset a dataframe with a boolean value
# gives a boolean series and return which rows have null values
customers[customers.isna().any(axis = 1)]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
8             9    Male  64.0                19.0                     NaN
13           14  Female  24.0                20.0                     NaN
17           18    Male   NaN                21.0                    66.0
25           26    Male   NaN                28.0                    82.0
42           43    Male   NaN                 NaN                     NaN
45           46  Female   NaN                39.0                    65.0
67           68  Female  68.0                48.0                     NaN
70           71    Male  70.0                49.0                     NaN
107         108    Male  54.0                63.0                     NaN
121         122  Female  38.0                 NaN                    40.0
122         123  Female  40.0                 NaN                    58.0
123         124    Male  39.0                 NaN                    91.0
193         194  Female  38.0               113.0                     NaN
199         200    Male  30.0               137.0                     NaN

In [53]:
# drop the rows that have null values
customers.dropna()

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
194         195  Female  47.0               120.0                    16.0
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0

[186 rows x 5 columns]

In [54]:
# Drop the columns have null values
customers.dropna(axis = 1)

     CustomerID  Gender
0             1    Male
1             2    Male
2             3  Female
3             4  Female
4             5  Female
..          ...     ...
195         196  Female
196         197  Female
197         198    Male
198         199    Male
199         200    Male

[200 rows x 2 columns]

In [55]:
len(customers)

200

In [57]:
customers.head(10)

   CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male  19.0                15.0                    39.0
1           2    Male  21.0                15.0                    81.0
2           3  Female  20.0                16.0                     6.0
3           4  Female  23.0                16.0                    77.0
4           5  Female  31.0                17.0                    40.0
5           6  Female  22.0                17.0                    76.0
6           7  Female  35.0                18.0                     6.0
7           8  Female  23.0                18.0                    94.0
8           9    Male  64.0                19.0                     NaN
9          10  Female  30.0                19.0                    72.0

In [59]:
# fill null values
# fill null values in Age with mean values and changing the df with inplace = True
customers['Age'].fillna(customers['Age'].mean(), inplace = True)

In [60]:
# check how many null values
customers.isna().sum().sum()

12

In [63]:
# fill all the null values with 0, does not change the df
customers.fillna(0)

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                15.0                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  23.0                16.0                    77.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
195         196  Female  35.0               120.0                    79.0
196         197  Female  45.0               126.0                    28.0
197         198    Male  32.0               126.0                    74.0
198         199    Male  32.0               137.0                    18.0
199         200    Male  30.0               137.0                     0.0

[200 rows x 5 columns]

In [65]:
# print lines 119 - 124
customers.iloc[119:125]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
119         120  Female  50.0                67.0                    57.0
120         121    Male  27.0                67.0                    56.0
121         122  Female  38.0                 NaN                    40.0
122         123  Female  40.0                 NaN                    58.0
123         124    Male  39.0                 NaN                    91.0
124         125  Female  23.0                70.0                    29.0

In [67]:
# fill the null values with ffill (forward fill) and changing the df
customers['Annual Income (k$)'].fillna(method = 'ffill', inplace = True)

In [68]:
customers.iloc[119:125]

     CustomerID  Gender   Age  Annual Income (k$)  Spending Score (1-100)
119         120  Female  50.0                67.0                    57.0
120         121    Male  27.0                67.0                    56.0
121         122  Female  38.0                67.0                    40.0
122         123  Female  40.0                67.0                    58.0
123         124    Male  39.0                67.0                    91.0
124         125  Female  23.0                70.0                    29.0

In [70]:
# filled empty (null) ages with average age
# customers['Age'].fillna(customers['Age'].mean(), inplace = True)
# filled null income with previous valid income
# customers['Annual Income (k$)'].fillna(method = 'ffill', inplace = True)
# drop all the rest of rows with the null values
customers.dropna(inplace = True)

In [71]:
len(customers)

192